In [1]:
data=[['sn','name','age','add'],
      [1,'ram',34,'ktm'],
      [2,'shyam',67,'bkt'],
      [3,'hari',40,'bir']]

In [2]:
import csv
file=open('data2.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [3]:
import pandas as pd
df=pd.read_csv('data2.csv')
df

   sn   name  age  add
0   1    ram   34  ktm
1   2  shyam   67  bkt
2   3   hari   40  bir

In [4]:
data={'name':['ram','shyam','hari'],
     'age':[45,67,43],
     'add':['ktm','bkt','ltl']}

In [5]:
df=pd.DataFrame(data)
df

    name  age  add
0    ram   45  ktm
1  shyam   67  bkt
2   hari   43  ltl

In [6]:
df.to_csv('data3.csv')

In [18]:
import csv
csv_columns=['name','age','add']
dict=[
    {'name':'abc','age':23,'add':'ktm'},
    {'name':'bcd','age':33,'add':'bir'}
]
csvfile=open("data.csv",'w')
writer=csv.DictWriter(csvfile,fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
csvfile.close()

In [12]:
data1={'name':['ram','shyam','hari'],
     'age':[45,67,43],
     'add':['ktm','bkt','ltl']}
df1=pd.DataFrame(data1)
data2={'name':['hram','yam','hari'],
     'age':[45,67,43],
     'add':['ktm','bkt','ltl']}
df2=pd.DataFrame(data2)
df=pd.concat([df1,df2])
#df=df1+df2
df

    name  age  add
0    ram   45  ktm
1  shyam   67  bkt
2   hari   43  ltl
0   hram   45  ktm
1    yam   67  bkt
2   hari   43  ltl

In [13]:
df=df.rename(columns={'name':'Name','age':'Age','add':'Add'})
df

    Name  Age  Add
0    ram   45  ktm
1  shyam   67  bkt
2   hari   43  ltl
0   hram   45  ktm
1    yam   67  bkt
2   hari   43  ltl

In [14]:
df.shape

(6, 3)

In [15]:
row,col=df.shape
print("no of row=",row)
print("no of col=",col)

no of row= 6
no of row= 3

In [16]:
df.info

<bound method DataFrame.info of     Name  Age  Add
0    ram   45  ktm
1  shyam   67  bkt
2   hari   43  ltl
0   hram   45  ktm
1    yam   67  bkt
2   hari   43  ltl>

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Add     6 non-null      object
dtypes: int64(1), object(2)
memory usage: 192.0+ bytes